import React from "react";

export const Left: React.FC = () => {


  return (
    <div className='absolute w-full h-[70px] bg-lime-400 rounded-bl-lg pl-3 sm:pl-20 pt-3 font-bold'>
      <div className="sm:hidden">
        <p className="text-sm">Покупка авто по одному звонку!</p>
      </div>
      <div className="flex items-center">
        <svg width="13" height="14" viewBox="0 0 13 14" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path
            d="M4.02358 6.42682C4.34823 7.78588 6.10131 9.46852 7.39988 9.79211C7.98424 9.92154 8.63353 9.59796 8.82832 9.0155C9.08803 8.17418 10.1918 7.91531 10.8411 8.56248L12.6591 10.3746C13.1136 10.8276 13.1136 11.6042 12.6591 12.1219L11.4255 13.3515C10.1269 14.6459 6.68567 13.2221 3.63401 10.1804C0.582352 7.13871 -0.781155 3.7087 0.452494 2.41436L1.68614 1.18474C2.14065 0.731716 2.91979 0.731716 3.43922 1.18474L5.25723 2.99681C5.90652 3.64399 5.6468 4.74418 4.80273 5.00304C4.21837 5.1972 3.8288 5.84437 4.02358 6.42682Z"
            fill="white"/>
        </svg>
        <p className="ml-4"><a href="tel:+37243675476">+372 43675 476</a></p>
      </div>
      <div className="items-center hidden sm:flex">
        <svg width="15" height="14" viewBox="0 0 15 14" fill="none" xmlns="http://www.w3.org/2000/svg">
          <g clip-path="url(#clip0_17_424)">
            <path
              d="M14.7544 1.91406L10.2399 7.44276L14.7544 12.9714C14.8361 12.7611 14.8855 12.5289 14.8855 12.2805V2.60497C14.8855 2.35663 14.8361 2.12442 14.7544 1.91406Z"
              fill="white"/>
            <path
              d="M8.3679 8.23005L14.1378 1.15399C13.9671 1.05329 13.7787 0.992371 13.5772 0.992371H1.30833C1.10686 0.992371 0.918463 1.05329 0.747803 1.15399L6.51768 8.23005C7.02791 8.85896 7.85766 8.85896 8.3679 8.23005Z"
              fill="white"/>
            <path
              d="M0.13112 1.91406C0.0494245 2.12442 0 2.35663 0 2.60497V12.2805C0 12.5289 0.0494245 12.7611 0.13112 12.9714L4.64561 7.44276L0.13112 1.91406Z"
              fill="white"/>
            <path
              d="M8.98454 8.99012C8.13444 10.038 6.75113 10.038 5.90132 8.99012L5.26229 8.20282L0.747803 13.7315C0.918463 13.8322 1.10686 13.8931 1.30833 13.8931H13.5772C13.7787 13.8931 13.9671 13.8322 14.1378 13.7315L9.62328 8.20282L8.98454 8.99012Z"
              fill="white"/>
          </g>
          <defs>
            <clipPath id="clip0_17_424">
              <rect width="14.8855" height="12.9008" fill="white" transform="translate(0 0.992371)"/>
            </clipPath>
          </defs>
        </svg>
        <p className="ml-4"><a href="mailto:info@example.ee">info@example.ee</a></p>
      </div>
    </div>
  );
};

export default Left;